app/controllers/products_controller.rb

SELECT  "products".* FROM "products"  WHERE "products"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "products" SET "ad_title" = ?, "updated_at" = ? WHERE "products"."id" = 1  [["ad_title", "fully furnished flat in Andheri East"], ["updated_at", "2014-09-06 14:17:35.428013"]]
---
def update
	@product = Product.find(params[:id])
	if @product.update_attributes(product_params)